Module 3, Advanced Python.
Building a web scraper that pulls data from https://btech-data-analytics.github.io/bridgerland-technical-college/employees_3.html
into a pandas datafram for analysis. 
Below we discover the average employee age and standard deviation.

In [1]:
#import statements
import pandas as pd              # create the table of data
import requests                  # fetch the data
from bs4 import BeautifulSoup    # parse through so we can move to creating dataframe.

In [6]:
# store the data from the request by naming it, response = ...      No need to keep sending HTTP requests.
response = requests.get('https://btech-data-analytics.github.io/bridgerland-technical-college/employees_3.html').text

In [8]:
soup = BeautifulSoup(response,'html.parser')

In [13]:
soup.find('table').find_all('tr', class_='employee')[0].find_all('td') #all the data from the FIRST [0] employee.

<tr class="employee">
<td>101</td>
<td>John Doe</td>
<td>28</td>
</tr>

In [14]:
soup.find('table').find_all('tr', class_='employee')[0].find_all('td')[1].text #first employee, second [1] column. display just the text.

'John Doe'

In [ ]:
#same concept as above but for ALL employees

In [21]:
id = []
name = []
age = []

for employee in soup.find('table').find_all('tr', class_='employee'):
    id.append(employee.find_all('td')[0].text) 
    name.append(employee.find_all('td')[1].text) 
    age.append(employee.find_all('td')[2].text)

In [22]:
age

['28', '32', '24', '29', '35', '27', '31', '33']

In [23]:
df = pd.DataFrame({
    'id' : id,
    'name' : name,
    'age' : age
})

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      8 non-null      object
 1   name    8 non-null      object
 2   age     8 non-null      object
dtypes: object(3)
memory usage: 324.0+ bytes

In [ ]:
#age is object, need to change datatype to int.

In [25]:
df['age'] = df['age'].astype(int)

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      8 non-null      object
 1   name    8 non-null      object
 2   age     8 non-null      int64
dtypes: int64(1), object(2)
memory usage: 324.0+ bytes

In [32]:
#Based on the data set, the average age of employees is 29.875
df['age'].mean()

np.float64(29.875)

In [31]:
#What is the standard deviation of employees found at the link above (according to pandas)?
df['age'].std().round(2)

np.float64(3.56)

In [33]:
df.head()

    id            name  age
0  101        John Doe   28
1  102      Jane Smith   32
2  103  Robert Johnson   24
3  104    Mary Johnson   29
4  105   Michael Brown   35